53Aries/Klipper_WiFi_MCU/esp-hosted-pi/sdkconfig.defaults.esp32c5
# ESP32-C5 specific overrides
CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.esp32c5.csv"

# C5 runs at 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# USB OTG on C5 — full speed (USB HS not available on C5)
CONFIG_USB_OTG_SUPPORTED=y

# WiFi 6 (802.11ax) — C5 supports it natively
CONFIG_ESP_WIFI_ENABLE_11AX=y

# Disable SPIRAM — not fitted on DevKit V2
CONFIG_SPIRAM=n
# ESP-Hosted-FG slave: ESP32-C5 overrides for KlipperESPwifi
# Processed LAST — overrides both sdkconfig.defaults and C5 chip defaults.

# ── C5-specific hardware ───────────────────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# ESP32-C5 DevKit V2.0 (H4 module) has 4MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.esp32c5.csv"
CONFIG_ESP_CACHE_MALLOC=y
CONFIG_WIFI_CMD_BASIC_ONLY=y

# ── Force SPI transport (C5 supports SDIO too; must be explicit) ───────────
CONFIG_ESP_SPI_HOST_INTERFACE=y

# ── Disable BT — WiFi only for Klipper bridge ─────────────────────────────
# Overrides CONFIG_BT_ENABLED=y in sdkconfig.defaults
CONFIG_BT_ENABLED=n

# ── Disable Network Split — Pi handles all routing ─────────────────────────
# We do not want the C5 running its own LWIP stack / DHCP client.
# The Pi is the AP and handles all network routing.
CONFIG_NETWORK_SPLIT_ENABLED=n

# ── Watchdog ───────────────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# ── IRAM optimisations ─────────────────────────────────────────────────────
# Place WiFi ISRs in IRAM — avoids flash cache stalls during SPI transfers
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y

# ── Logging ────────────────────────────────────────────────────────────────
# Info only — verbose logs add SPI overhead during operation
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── GPIO pins ─────────────────────────────────────────────────────────────
# IMPORTANT: On ESP32-C5, the MSPI (flash) controller permanently owns the
# IO_MUX SPI2 pads (IO2, IO6, IO7, IO10) in DIO/QIO mode.  Using those for
# the GP-SPI slave causes all-0xFF on MISO because flash wins the pin.
#
# GPIO11/12 = UART0 TX/RX, GPIO13/14 = USB D-/D+ — also unavailable.
#
# We route SPI2 through the GPIO matrix to free pins on the right side:
#   MISO=IO23   MOSI=IO24   CLK=IO15   CS=IO28
#   Handshake=IO4   DataReady=IO5
CONFIG_ESP_SPI_HSPI_GPIO_MOSI=24
CONFIG_ESP_SPI_HSPI_GPIO_MISO=23
CONFIG_ESP_SPI_HSPI_GPIO_CLK=15
CONFIG_ESP_SPI_HSPI_GPIO_CS=28
CONFIG_ESP_SPI_GPIO_HANDSHAKE=4
CONFIG_ESP_SPI_GPIO_DATA_READY=5
